blog-posts/2005-02-04-ri-mode-bug-when-there-is-no-current-word.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>ri-mode bug when there is no current word</title>
<!-- 2014-04-30 Wed 16:58 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">ri-mode bug when there is no current word</h1>
<p>
February 4th, 2005 -
<a href="http://sachachua.com/blog/p/2615"><a href="http://sachachua.com/blog/p/2615">http://sachachua.com/blog/p/2615</a></a>
</p>

<p>
I replaced the stock implementation of ruby-default-ri-entry with the
 following code so that I could use it even if I didn't have a current
 word.
</p>

<pre class="example">
(defun ruby-default-ri-entry ()
  (let (word)
    (save-excursion
      (setq word (or (current-word) ""))
      (if (string-match "[._]+$" word)
      (setq word (substring word 0 (match-beginning 0))))
      (format "%s%s"
          word
          ""))))
</pre>

<p>
<a href="http://sachachua.com/notebook/emacs/ruby-config.el">../emacs/ruby-config.el</a>
</p>

<p>
On Technorati: <a href="http://www.technorati.com/tag/emacs">emacs</a>
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
